In [1]:
import numpy as np
import pandas as pd

In [2]:
student_data1 = pd.DataFrame({'student_id':['S1', 'S2', 'S3'], 'name':['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen'], 'marks':[200, 210, 190]})
student_data2 = pd.DataFrame({'student_id':['S4', 'S5', 'S6'], 'name':['Scarlette Fisher', 'Carla Williamson', 'Dante Morse'], 'marks':[201, 200, 198]})

In [3]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190

In [4]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198

In [5]:
new = pd.concat([student_data1, student_data2], axis = 0)

In [6]:
new

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198

In [7]:
exam_data = pd.DataFrame({'student_id':['S1', 'S2', 'S3', 'S4', 'S5', 'S7'], 'exam_id':[23, 45, 12, 67, 21, 55]})

In [8]:
exam_data

  student_id  exam_id
0         S1       23
1         S2       45
2         S3       12
3         S4       67
4         S5       21
5         S7       55

In [9]:
d = pd.merge(new, exam_data, on = 'student_id', how = 'inner')

In [10]:
d

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4  Scarlette Fisher    201       67
4         S5  Carla Williamson    200       21